utility-wise, now we can do things like:
```hcl
locals {
  disk_names = ["sda", "sdb", "sdc", "sdd", "sde", "sdf", "sdg", "sdf"]
  disk_map_1 = distinct(flatten(([
    for disk_name in local.disk_names : [
      for machine in openstack_compute_instance_v2.metal-1 : {
        disk = disk_name
        machine = machine.name
      }
    ]
  ])))
}
data "maas_block_device" "metal-1" {
  for_each =  { for entry in local.disk_map_1: "${entry.machine}.${entry.disk}" => entry }
  name = each.value.disk
  machine = each.value.machine
}
resource "maas_block_device" "metal-1-sda" {
  for_each       = { for k,v in data.maas_block_device.metal-1: k => v if v.name == "sda" }
  machine        = each.value.machine
  name           = "sda"
  id_path        = each.value.id_path
  size_gigabytes = 64
  tags = [
    "os_drive",
  ]
  partitions {
    size_gigabytes = 32
    fs_type        = "ext4"
    label          = "os"
    mount_point    = "/"
  }
  partitions {
    size_gigabytes = 1
    fs_type        = "fat32"
    mount_point    = "/boot"
  }
}
resource "maas_block_device" "metal-1-data" {
  for_each       = { for k,v in data.maas_block_device.metal-1: k => v if v.size_gigabytes == 128 && v.name == "sda" }
  machine        = each.value.machine
  name           = each.value.name
  id_path        = each.value.id_path
  size_gigabytes = 1
  tags = [
    "data_drive",
  ]
  partitions {
    size_gigabytes = 128
    fs_type        = "xfs"
    label          = "data"
  }
}
```
which on just 4 machines produce:
```hcl
OpenTofu will perform the following actions:

  # maas_block_device.metal-1-data["test-metal1-00.sdb"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_3c0f9f80-014d-4f9e-8d37-37cc57911ea9"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sdb"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-00.sdc"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_f53c08da-8c39-4112-8610-0a1c0a9f581b"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sdc"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-00.sdd"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_668d5958-6c8a-4342-a2d5-999731e81723"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sdd"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-00.sde"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_552ce1f9-ebf7-43d2-95fc-3a8f06599dcd"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sde"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-00.sdf"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_19e99891-e4d5-4ba0-b8f6-12e3eb5f295f"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sdf"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-01.sdb"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_170dae87-3e3e-41fd-8d29-72333bce542f"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sdb"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-01.sdc"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_ffe27ee5-dd48-45cf-b9b8-0cd3e3e564cc"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sdc"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-01.sdd"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_9610c723-b078-4ca1-93d7-97bdadc51bdb"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sdd"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-01.sde"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_8c9ad6ea-df74-43a4-9c7a-a4ed2c910822"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sde"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-01.sdf"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_69216d51-5636-47a3-98ce-0bd7b925d138"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sdf"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-02.sdb"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_e21ffede-7c38-4f3d-903c-60f23dde86ce"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sdb"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-02.sdc"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_d4ecbad3-afa2-4edd-b7d7-6ed635e14413"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sdc"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-02.sdd"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_e5f412a5-5c55-4b18-bf40-c7fa844b1b59"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sdd"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-02.sde"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_539dc79e-2909-484a-9837-805c33c2dba0"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sde"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-02.sdf"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_e78a0ed7-b6ca-4cf9-8ef6-3e7d1bc7b5e4"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sdf"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-03.sdb"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_5a992add-e46f-4e94-9ddc-44a819f40f7f"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sdb"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-03.sdc"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_eb51d787-6df8-4b40-98e8-663a23b265b1"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sdc"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-03.sdd"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_1dd2bab7-26b3-4f0a-a23e-5a435dfddd29"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sdd"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-03.sde"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_81063dc4-ef55-4964-a8b1-fe8d7f778309"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sde"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-data["test-metal1-03.sdf"] will be created
  + resource "maas_block_device" "metal-1-data" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_a74b3c68-f468-462a-8e0e-884c4e0f0b0c"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sdf"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 1
      + tags           = [
          + "data_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "xfs"
          + label          = "data"
          + path           = (known after apply)
          + size_gigabytes = 128
        }
    }

  # maas_block_device.metal-1-sda["test-metal1-00.sda"] will be created
  + resource "maas_block_device" "metal-1-sda" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_ef57b0e9-646c-479b-9565-485e9bc6842d"
      + machine        = "fwtq6w"
      + model          = (known after apply)
      + name           = "sda"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 64
      + tags           = [
          + "os_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "ext4"
          + label          = "os"
          + mount_point    = "/"
          + path           = (known after apply)
          + size_gigabytes = 32
        }
      + partitions {
          + fs_type        = "fat32"
          + mount_point    = "/boot"
          + path           = (known after apply)
          + size_gigabytes = 1
        }
    }

  # maas_block_device.metal-1-sda["test-metal1-01.sda"] will be created
  + resource "maas_block_device" "metal-1-sda" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_e74258a3-e454-46cc-b54e-5a375fdbc1e8"
      + machine        = "ssmxyw"
      + model          = (known after apply)
      + name           = "sda"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 64
      + tags           = [
          + "os_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "ext4"
          + label          = "os"
          + mount_point    = "/"
          + path           = (known after apply)
          + size_gigabytes = 32
        }
      + partitions {
          + fs_type        = "fat32"
          + mount_point    = "/boot"
          + path           = (known after apply)
          + size_gigabytes = 1
        }
    }

  # maas_block_device.metal-1-sda["test-metal1-02.sda"] will be created
  + resource "maas_block_device" "metal-1-sda" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_f4b1f935-b88a-45e0-81a1-d386a87da8b0"
      + machine        = "kherdk"
      + model          = (known after apply)
      + name           = "sda"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 64
      + tags           = [
          + "os_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "ext4"
          + label          = "os"
          + mount_point    = "/"
          + path           = (known after apply)
          + size_gigabytes = 32
        }
      + partitions {
          + fs_type        = "fat32"
          + mount_point    = "/boot"
          + path           = (known after apply)
          + size_gigabytes = 1
        }
    }

  # maas_block_device.metal-1-sda["test-metal1-03.sda"] will be created
  + resource "maas_block_device" "metal-1-sda" {
      + block_size     = 512
      + id             = (known after apply)
      + id_path        = "/dev/disk/by-id/scsi-SQEMU_QEMU_HARDDISK_5d5de7e6-d88a-4d95-ac26-b014132eca33"
      + machine        = "yxsy7e"
      + model          = (known after apply)
      + name           = "sda"
      + path           = (known after apply)
      + serial         = (known after apply)
      + size_gigabytes = 64
      + tags           = [
          + "os_drive",
        ]
      + uuid           = (known after apply)

      + partitions {
          + fs_type        = "ext4"
          + label          = "os"
          + mount_point    = "/"
          + path           = (known after apply)
          + size_gigabytes = 32
        }
      + partitions {
          + fs_type        = "fat32"
          + mount_point    = "/boot"
          + path           = (known after apply)
          + size_gigabytes = 1
        }
    }
```